gsoap/happy.ChatShake.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
  xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
  xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
  xmlns:xsd="http://www.w3.org/2001/XMLSchema"
  xmlns:happy="http://tempuri.org/happy.xsd">
 <SOAP-ENV:Body>
  <happy:ChatShake>
   <key></key>
   <content></content>
  </happy:ChatShake>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
